#+title: Exercise 35
*** Result

#+begin_src elisp :exports code
(org-babel-tangle)
#+end_src

#+RESULTS:
| /home/bwongwandanee/proj/sicp/exercises/chapter-3/src/exercise-35.rkt |

#+begin_src bash :exports both :results output
racket ./src/exercise-35.rkt
#+end_src

#+RESULTS:
:
: Probe: result = 4
: Probe: input = 2#<procedure:...src/exercise-35.rkt:131:2>
:
: Probe: input = 2
: Probe: result = 4#<procedure:...src/exercise-35.rkt:131:2>
